[{
  "title": "Approve the Addition of Delegated Claims for Select Product Types",
  "shortDescription": "On behalf of the Foundation and the DAO team, BraveNewDeFi has proposed that members approve the addition of Delegated Claims functionality for select Product Types.",
"description": "The Foundation and DAO teams have been prioritizing growth in cover sales and onboarding new syndicates (i.e., staking pool managers with an existing distribution pipeline). We're currently working to onboard a new syndicate that can meaningfully contribute to the growth of cover sales. This syndicate will require additional functionality to offer new Product Types through their staking pool, specifically the ability to delegate to an Ethereum address as a designated assessor.\n\nThis functionality would enable certain Product Types to have a designated third-party claim assessor as defined in the cover wording for that Product Type. If someone were to buy cover for a Product Type with delegated claims enabled, then claims for that Product Type could only be assessed by the designated claim assessor.\n\nOn behalf of the Foundation and the DAO team, BraveNewDeFi has proposed that members approve the addition of Delegated Claims functionality for select Product Types. Doing so will enable the Mutual to onboard new types of syndicates with established distribution in onchain and offchain markets.\n\n## Rationale\n\nOne soon-to-be-onboarded syndicate and several potential syndicates have indicated they need to define who is responsible for claim assessment as a core business requirement, making the delegated claims functionality a material requirement for onboarding them as syndicates.\n\n## Specification\n\nFor certain Product Types, there will be a requirement to have a designated Claim Assessor rather than opening the claim vote to all members, as we currently do for our Product Types.\n\nA Delegated Claims system would allow specialized assessors to review a claim. This functionality would allow the Mutual to underwrite new Product Types and access new lines of business. This feature would give syndicates and their respective clients an option to specify a more familiar claims process that is closer to traditional insurance, rather than the standard process where any NXM holder can vote.\n\n### Technical Specification for Designated Pool Managers\n\nThis Product Type will be designed for bespoke deals underwritten by syndicates (i.e., staking pool manager(s)). When listing a Delegated Claims Product Type, the Advisory Board will need to specify the Designated Pool Address(es) AND the Designated Assessor Address in the onchain data. Only the Designated Staking Pool(s) will be able to stake against listings within a given Delegated Claims Product Type.\n\nOnce a Delegated Claims Product Type is listed and a Designated Pool Manager has staked against a listing under that Product Type, the Foundation Frontend team will denote that the listing for this Product Type uses Delegated Claims in the UI.\n\nThe Designated Assessor Address for a Product Type can be updated in the future, but only the Advisory Board will have the power to update a Product Type's onchain data.\n\n### Technical Specification for Designated Claim Assessors\n\nWhen a cover holder submits a claim, the Designated Pool Manager will be responsible for notifying the Designated Claim Assessor. The Designated Assessor Address will be the only address that is registered and able to vote on the claim.\n\nIf an address other than the Designated Assessor Address tries to vote, that member will see a message telling them that voting on this claim is not available because this cover is for a Product Type that uses the Delegated Claims method.\n\nFor more information, see the complete NMPIP as posted on the Nexus Mutual governance forum: https://forum.nexusmutual.io/t/nmpip-approve-the-addition-of-delegated-claims-for-select-product-types/1531/1"
}]
