[{
  "title": "Offboard DAI as a Capital Pool Asset",
  "shortDescription": "BraveNewDeFi has proposed that Nexus Mutual members vote to offboard DAI as a Capital Pool asset and grant the Advisory Board the power to complete the four (4) stages of offboarding outlined in the proposal.",
  "description": "On 18 September, MakerDAO rebranded to Sky Money and launched their new stablecoin, USDS. This rebrand is part of Sky Money's End Game plan to scale stablecoin adoption for their protocol. While existing DAI holders can convert DAI to USDS, that is completely optional and users are able to hold DAI or convert back at this time.\n\nGiven Sky Money is moving toward more real world asset (RWA) backing, USDS has a blacklist function, and the Product & Risk team anticipates that DAI-denominated cover demand will further shrink, BraveNewDeFi has proposed that Nexus Mutual members vote to offboard DAI as a Capital Pool asset and grant the Advisory Board the power to complete the four (4) stages of offboarding:\n\n* **Stage 1**: Disable DAI-denominated cover buys at user interface (UI) level\n* **Stage 2**: Wait until the last DAI cover expires and the grace period for that cover to end\n* **Stage 3**: Swap all DAI in the Capital Pool for USDC\n* **Stage 4**: Offboard DAI as an asset in the Capital Pool\n\n## Rationale\n\n### Decreasing Demand for DAI-Denominated Covers, Growth in Demand for USDC-Denominated Covers\n\nActive cover has largely skewed toward USDC since USDC was onboarded to the Capital Pool in June 2024.\n\nAt present, the Mutual has 25,213,302 DAI worth of active cover liabilities (36% of total active cover). Compare that to 27,380,545 USDC worth of active cover liabilities (39% of total active cover), and it's clear there's a growing trend away from DAI-denominated covers and a growth in USDC-denominated covers.\n\nThe vast majority of the Mutual's exposure to DAI-denominated covers will expire by the end of October.\n\n### Endgame Trajectory: Sky Money Pushes Growth of USDS Over DAI\n\nAccording to the The 5 phases of Endgame (https://forum.makerdao.com/t/the-5-phases-of-endgame/20830) MakerDAO forum post authored by Rune and posted in May 2023, Endgame serves as a \"major update to MakerDAO designed to enhance efficiency, resilience, and participation by creating a strong governance equilibrium that acts as the bedrock for SubDAOs to parallelize growth and product innovation in an emergent, community-driven ecosystem.\"\n\nMore from the introduction:\n\n\"The short term objective of Endgame is to grow the Dai supply to more than 100 billion within 3 years, and from there ensure that the ecosystem is anchored in an autonomous and vibrant DAO economy that continues to grow at an accelerating rate, while safely maintaining the governance equilibrium to ensure it can scale to any size.\"\n\nPhase 1 of the five (5) phase plan has started with the launch of the Sky Money brand and USDS stablecoin. While DAI still remains, USDS will be the core focus for Sky Money and the Endgame roadmap going forward. As part of the Phase 1 launch, the Spark subDAO will be expanding into new lines of business (https://forum.makerdao.com/t/makerdao-endgame-launch-season/23857), which includes the ability to \"deploy capital into Real World Assets, using the already well-established and proven RWA infrastructure of MakerDAO that has been battle-hardened by protecting more than a billion USD worth of RWA for over 2 years. Having access to RWA and the yield available in traditional finance complements the on-chain lending business model well, as it allows Spark to shift its exposure to whichever environment has the best risk-adjusted return…\" and \"... tap into the yield available in crypto perpetual swap markets through mechanisms such as Ethena sUSDe. During bull markets this is a unique low-risk yield opportunity. The mechanism also synergizes well with a native lending engine and access to RWA yields, because Spark will be able to shift to wherever the best opportunities are available, something that continuously changes with market cycles and conditions.\"\n\nWith an increase in RWA adoption, the DAI/USDS centralized collateral-backing will grow.\n\nGiven PSM Vaults and RWA Vaults both contain centralized assets, the centralized backing for DAI is nearing 60%. The Endgame plan will likely increase RWA-asset backing as SparkLend onboards more RWA collateral into their lending platform.\n\nOne of the core reasons to hold DAI in the Capital Pool was to offer Nexus Mutual members a censorship resistant, decentralized stablecoin as a claim payment option. As centralized collateral for DAI has grown and USDS will increase that exposure over time, the Product & Risk team believes that the recent onboarding of USDC to the Capital Pool is sufficient for our membership base as a cover denomination/claim payment option for stablecoin-denominated cover.\n\n## Specification\n\nOffboarding an asset from the Capital Pool involves several steps:\n\n* **Stage 1**: Disable DAI-denominated cover buys at user interface (UI) level\n* **Stage 2**: Wait until the last DAI cover expires and the grace period for that cover to end\n* **Stage 3**: Swap all DAI in the Capital Pool for USDC\n* **Stage 4**: Offboard DAI as an asset in the Capital Pool\n\nIf members were to vote to offboard DAI as a Capital Pool asset, then the Foundation Engineering frontend team would begin with Stage 1 by disabling the option for DAI-denominated cover buys in the Nexus Mutual UI.\n\nIf this proposal is approved and no new DAI-denominated cover buys occur between now and a potential approval vote, then DAI could be offboarded in April 2025.\n\nFor more information, see the complete NMPIP as posted on the Nexus Mutual governance forum: https://forum.nexusmutual.io/t/nmpip-offboard-dai-as-a-capital-pool-asset/1532/1"
}]
