[{
  "title": "Onboard cbBTC as a Capital Pool Asset",
  "shortDescription": "BraveNewDeFi is proposing that Nexus Mutual members vote to onboard cbBTC as a Capital Pool asset and grant the Advisory Board the power to complete the three (3) stages of onboarding, as outlined in the proposal.",
  "description": "On 12 September 2024, Coinbase launched Coinbase Wrapped BTC (cbBTC), a BTC derivative that is backed 1-to-1 with BTC held in custody by Coinbase. Onboarding cbBTC as a Capital Pool asset would present the Mutual with a competitive advantage as the Foundation and DAO teams look to expand into new lines of business and appeal to a broader audience of crypto-native users.\n\nOn behalf of the Product & Risk team, BraveNewDeFi is proposing that Nexus Mutual members vote to onboard cbBTC as a Capital Pool asset and grant the Advisory Board the power to complete the three (3) stages of onboarding:\n\n* **Stage 1**: Onboard cbBTC as an asset in the Capital Pool\n* **Stage 2**: Swap ETH for cbBTC (initial amount of $1M)\n* **Stage 3**: Enable cbBTC-denominated cover buys at user interface (UI) level\n\n## Rationale\n\ncbBTC has grown to 5,991 BTC ($392.5M Market Cap) in a matter of 1 month since its initial launch. In that time, cbBTC has climbed the Bridge TVL rankings into the top 10, if it were listed on DefiLlama.\n\nOnchain liquidity for cbBTC has grown quickly, as well, with $63M+ worth of cbBTC liquidity established on Ethereum, primarily in three (3) Uniswap v3 pools. Of course, cbBTC can be minted and redeemed directly on Coinbase by users and can be traded on the exchange, as well. Between onchain liquidity and the mint/redeem function on Coinbase, there's sufficient liquidity to acquire and hold a minimum of $1M in cbBTC in the Capital Pool.\n\ncbBTC is poised for growth at the institutional layer and across DeFi, as major lending protocols have or are working to onboard cbBTC to their markets. Given Coinbase is the primary custodian for both the BTC and ETH ETFs, there's a high likelihood that cbBTC's market share will grow substantially by the end of 2024.\n\nIn the NMPIP post on the forum, BraveNewDeFi has gone into detail regarding the following:\n\n* The business case for onboarding cbBTC to the Capital Pool\n* The risks associated with onboarding cbBTC as a Capital Pool asset\n* The rationale for not pursuing other BTC derivatives\n\nSee the forum post for the complete review and assessment: https://forum.nexusmutual.io/t/nmpip-onboard-cbbtc-as-a-capital-pool-asset/1534/1\n\n### Risks Associated with Onboarding cbBTC as a Capital Pool Asset\n\nOnboarding cbBTC would allow the Mutual to tap into new markets, user segments, and lines of business. However, this decision comes with additional risk. In the NMPIP, BraveNewDeFi also reviews the core risks associated with onboarding cbBTC to the Capital Pool.\n\nSee the forum post for the complete risk summary: https://forum.nexusmutual.io/t/nmpip-onboard-cbbtc-as-a-capital-pool-asset/1534/1\n\n## Specification\n\nIf members were to vote in favor of onboarding cbBTC to the Capital Pool, the Advisory Board would onboard cbBTC as an asset in the Capital Pool.\n\nOnce that step is complete, the Advisory Board would work with the Foundation Engineering team to swap ETH for $1M worth of cbBTC. The Advisory Board would then work with the Foundation Engineering team to enable cbBTC-denominated cover buys at user interface (UI) level to complete the onboarding process.\n\nFor more information, see the complete NMPIP as posted on the Nexus Mutual governance forum: https://forum.nexusmutual.io/t/nmpip-onboard-cbbtc-as-a-capital-pool-asset/1534/1"
}]
